import math

print('Решаем квадратное уравнение 5x^2 - 10x - 400 = 0')

a = 5
b = -10
c = -400

print(f'Коэффициент a = {a}')
print(f'Коэффициент b = {b}')
print(f'Коэффициент c = {c}')

d = b**2 - 4*a*c

if d < 0:
    print('Дискриминант меньше нуля, корней нет')

elif d == 0:
    x = -b / (2 * a)
    print(f'Дискриминант равен нулю, корень один: x = {x}')

else:
    x1 = (-b + math.sqrt(d)) / (2*a)
    x2 = (-b - math.sqrt(d)) / (2*a)
    print(f'Первый корень уравнения: x1 = {x1}')
    print(f'Второй корень уравнения: x2 = {x2}')